cask_args appdir: '/Applications'

# Tap repositories
tap 'homebrew/bundle'
tap 'homebrew/php'
tap 'caskroom/cask'

# ------------------------------------------------------------------------------
# Installations requiring user input (sudo, Apple ID, etc.)
# ------------------------------------------------------------------------------

# Please place tools, which require sudo permissions during the installation at 
# the top to allow the script to run unattended afterwards

cask 'amazon-music'
cask 'mactex'
cask 'vmware-fusion'

# Command line tool wrapper for macOS' App Store, which allows to script the 
# installation of purchased apps. This was placed at the beginning, because a 
# signin with the Apple ID is required upfront
brew 'mas'

# ------------------------------------------------------------------------------
# Mac App Store
# ------------------------------------------------------------------------------

mas 'DaisyDisk', id: 411643860
mas 'Moom', id: 419330170
mas 'MoneyMoney', id: 872698314
mas 'Mouseposé', id: 405904955
mas 'Pocket', id: 568494494
mas 'Redacted', id: 984968384
mas 'Reeder 3', id: 880001334
mas 'The Unarchiver', id: 425424353

# ------------------------------------------------------------------------------
# GNU and/or newer versions of standard programs
# ------------------------------------------------------------------------------

brew 'coreutils'
brew 'openssl'

# ------------------------------------------------------------------------------
# Coding tools
# ------------------------------------------------------------------------------

brew 'composer'
brew 'yarn'

# ------------------------------------------------------------------------------
# Company code dependencies
# ------------------------------------------------------------------------------

brew 'awscli'

# ------------------------------------------------------------------------------
# Shell enhancements & script dependencies
# ------------------------------------------------------------------------------

brew 'zsh'
brew 'zsh-completions'


# ------------------------------------------------------------------------------
# Useful system utilities
# ------------------------------------------------------------------------------

brew 'htop'
brew 'pstree'
brew 'tree'
brew 'wget'

# ------------------------------------------------------------------------------
# Casks
# ------------------------------------------------------------------------------

cask 'appcleaner'
cask 'arduino'
cask 'boxcryptor'
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
# Breaking the automatic installation, thus commented out for now
# see https://github.com/caskroom/homebrew-cask/issues/29297
#cask 'gpgtools'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'macdown'
cask 'omnifocus'
cask 'omnigraffle'
cask 'postman'
cask 'sketch'
cask 'slack'
cask 'sourcetree'
cask 'teamspeak-client'
cask 'viscosity'
cask 'visual-studio-code'
cask 'yubikey-neo-manager'
cask 'x-lite'
