cask_args appdir: '/Applications'

# Tap repositories
tap 'homebrew/bundle'
tap 'homebrew/php'
tap 'caskroom/cask'

# Repository: homebrew/bundle
brew 'coreutils'
brew 'nvm'
brew 'openssl'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# Repository: homebrew/php
brew 'composer'

# Repository: caskroom/cask
cask 'amazon-music'
cask 'appcleaner'
cask 'arduino'
cask 'boxcryptor'
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'lastpass'
cask 'macdown'
cask 'mactex'
cask 'mendeley-desktop'
cask 'omnifocus'
cask 'omnigraffle'
cask 'owncloud'
cask 'phpstorm'
cask 'pycharm'
cask 'slack'
cask 'sourcetree'
cask 'steam'
cask 'steelseries-engine'
cask 'teamspeak-client'
cask 'vagrant'
cask 'vagrant-manager'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vmware-fusion7'
cask 'webstorm'
cask 'yubikey-neo-manager'

# Note: Vagrant requires version 5.0.x, but homebrew cask installs version 5.1.x.
# Unfortunately this version cannot be installed through caskroom/versions. Thus
# it has to be installed manually with its extension pack. 
#
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'